eclipse-threadx/getting-started/SiliconLabs/EFR32MG12/lib/gecko_sdk_3.0.0_efr32mg12/platform/emlib/inc/em_acmp.h
/** ACMP initialization structure. */
typedef struct {
#if defined(_ACMP_CTRL_FULLBIAS_MASK)
  /** Full-bias current. See the ACMP chapter about bias and response time in
   *  the reference manual for details. */
  bool                         fullBias;
#endif

#if defined(_ACMP_CTRL_HALFBIAS_MASK)
  /** Half-bias current. See the ACMP chapter about bias and response time in
   *  the reference manual for details. */
  bool                         halfBias;
#endif

  /** Bias current. See the ACMP chapter about bias and response time in the
   *  reference manual for details. Valid values are in the range 0-7. */
  uint32_t                     biasProg;

#if defined(_ACMP_CTRL_IFALL_SHIFT)
  /** Enable setting the interrupt flag on the falling edge. */
  bool                         interruptOnFallingEdge;
#endif
#if defined(_ACMP_CTRL_IRISE_SHIFT)
  /** Enable setting the interrupt flag on the rising edge. */
  bool                         interruptOnRisingEdge;
#endif

#if defined(_ACMP_CTRL_INPUTRANGE_MASK) \
  || defined(_ACMP_CFG_INPUTRANGE_MASK)
  /** Input range. Adjust this setting to optimize the performance for a
   *  given input voltage range.  */
  ACMP_InputRange_TypeDef      inputRange;
#endif

#if defined(_ACMP_CTRL_ACCURACY_MASK) \
  || defined(_ACMP_CFG_ACCURACY_MASK)
  /** ACMP accuracy mode. Select the accuracy mode that matches the
   *  required current usage and accuracy requirement. Low accuracy
   *  consumes less current while high accuracy consumes more current. */
  ACMP_Accuracy_TypeDef        accuracy;
#endif

#if defined(_ACMP_CTRL_PWRSEL_MASK)
  /** Select the power source for the ACMP. */
  ACMP_PowerSource_TypeDef     powerSource;
#endif

#if defined(_ACMP_CTRL_WARMTIME_MASK)
  /** Warmup time, which is measured in HFPERCLK / HFPERCCLK cycles and should be
   *  about 10 us in wall clock time. */
  ACMP_WarmTime_TypeDef        warmTime;
#endif

#if defined(_ACMP_CTRL_HYSTSEL_MASK) \
  ||  defined(_ACMP_CFG_HYST_MASK)
  /** Hysteresis level. */
  ACMP_HysteresisLevel_TypeDef hysteresisLevel;
#else
  /** Hysteresis when ACMP output is 0. */
  ACMP_HysteresisLevel_TypeDef hysteresisLevel_0;

  /** Hysteresis when ACMP output is 1. */
  ACMP_HysteresisLevel_TypeDef hysteresisLevel_1;
#endif

#if defined(_ACMP_INPUTSEL_VLPSEL_MASK)
  /** VLP Input source. Select between using VADIV or VBDIV as the VLP
   *  source. */
  ACMP_VLPInput_Typedef        vlpInput;
#endif

  /** Inactive value emitted by ACMP during warmup. */
  bool                         inactiveValue;

#if defined(_ACMP_INPUTSEL_LPREF_MASK)
  /** Low power reference enabled. This setting, if enabled, reduces the
   *  power used by the VDD and bandgap references. */
  bool                         lowPowerReferenceEnabled;
#endif

#if defined(_ACMP_INPUTCTRL_VREFDIV_MASK)
  /** VDD division factor. VREFOUT = VREFIN * (VREFDIV / 63).
   *  Valid values are in the 0-63 range. */
  uint32_t                     vrefDiv;
#elif defined(_ACMP_INPUTSEL_VDDLEVEL_MASK)
  /** VDD reference value. VDD_SCALED = VDD * VDDLEVEL * 50 mV/3.8 V.
   *  Valid values are in the 0-63 range. */
  uint32_t                     vddLevel;
#endif

  /** If true, ACMP is enabled after configuration. */
  bool                         enable;
} ACMP_Init_TypeDef;

/** Default configuration for ACMP regular initialization. */
#if defined(_ACMP_CFG_MASK)
#define ACMP_INIT_DEFAULT                                                     \
  {                                                                           \
    0x2,                      /* Using biasProg value of 0x2. */              \
    acmpInputRangeFull,       /* Input range from 0 to Vdd. */                \
    acmpAccuracyLow,          /* Low accuracy, less current usage. */         \
    acmpHysteresisDisabled,   /* Disable hysteresis. */                       \
    false,                    /* Output 0 when ACMP is inactive. */           \
    0x3F,                     /* Set VREFDIV to maximum to disable divide. */ \
    true                      /* Enable after init. */                        \
  }
#elif defined(_ACMP_HYSTERESIS0_HYST_MASK)
#define ACMP_INIT_DEFAULT                                                   \
  {                                                                         \
    false,                    /* fullBias */                                \
    0x7,                      /* biasProg */                                \
    false,                    /* No interrupt on falling edge. */           \
    false,                    /* No interrupt on rising edge. */            \
    acmpInputRangeFull,       /* Input range from 0 to VDD. */              \
    acmpAccuracyLow,          /* Low accuracy, less current usage. */       \
    acmpPowerSourceAvdd,      /* Use the AVDD supply. */                    \
    acmpHysteresisLevel5,     /* Use hysteresis level 5 when output is 0 */ \
    acmpHysteresisLevel5,     /* Use hysteresis level 5 when output is 1 */ \
    acmpVLPInputVADIV,        /* Use VADIV as the VLP input source. */      \
    false,                    /* Output 0 when ACMP is inactive. */         \
    true                      /* Enable after init. */                      \
  }
#else
#define ACMP_INIT_DEFAULT                                                   \
  {                                                                         \
    false,            /* fullBias */                                        \
    false,            /* halfBias */                                        \
    0x7,              /* biasProg */                                        \
    false,            /* No interrupt on falling edge. */                   \
    false,            /* No interrupt on rising edge. */                    \
    acmpWarmTime512,  /* 512 cycle warmup to be safe */                     \
    acmpHysteresisLevel5,                                                   \
    false,            /* Disabled emitting inactive value during warmup. */ \
    false,            /* low power reference */                             \
    0x3D,             /* VDD level */                                       \
    true              /* Enable after init. */                              \
  }
#endif

